11/data/attachments/4ab9ab839c049894.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d68ab28d-3076-45c5-9efc-575aac863dcc</nif:username>
            <nif:friendToBeAdded>Brian_specific_Friend_41207_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>